# BeginMultipleDuplicate

## Description
Use this function in conjuction with EndMultipleDuplicate to preserve constraints on multiple duplicated objects.

```pascal
PROCEDURE BeginMultipleDuplicate;
```

```python
def vs.BeginMultipleDuplicate():
    return None
```

## Examples
TraverseObjectsInActiveLayer

```pascal
BeginMultipleDuplicate;
```
```python
import vs

# Use this function in conjuction with EndMultipleDuplicate to preserve
# constraints on multiple duplicated objects.
vs.BeginMultipleDuplicate()
newObj = vs.LNewObj()  # handle to the newly created object
```

## See Also
VS Functions:
EndMultipleDuplicate

## Version
Availability: from Vectorworks 2011

## Category
* Object Editing